{
  "sections": [
    {
      "id": "section1",
      "title": {
        "zh": "第一部分：介绍",
        "en": "Part 1: Introduction"
      },
      "paragraphs": [
        {
          "zh": "这是一个简约的左右布局网页示例，左侧为固定目录，支持点击跳转到右侧正文对应区域，右侧为可滚动的正文内容。整体样式采用极简设计，去除多余装饰，突出内容本身，适配电脑端的日常阅读场景。",
          "en": "This is a minimalist left-right layout example. The left side features a fixed directory for easy navigation, while the right side displays scrollable content. The design is clean and simple, removing unnecessary decorations to highlight the content itself, making it perfect for desktop reading."
        },
        {
          "zh": "该布局广泛适用于文档阅读、博客文章、技术教程等场景，核心优势是导航清晰，用户无需反复翻找内容，提升阅读体验。",
          "en": "This layout is widely applicable to document reading, blog articles, technical tutorials, and more. Its key advantage is clear navigation, allowing users to find content easily without repetitive searching, thereby enhancing the reading experience."
        }
      ]
    },
    {
      "id": "section2",
      "title": {
        "zh": "第二部分：核心内容",
        "en": "Part 2: Core Content"
      },
      "paragraphs": [
        {
          "zh": "布局的核心是通过CSS的flex弹性布局实现左右分栏，左侧目录设置为固定定位（fixed），保证滚动正文时目录始终可见；右侧正文区域设置左外边距，避开左侧固定目录，同时开启垂直滚动。",
          "en": "The core of the layout is implementing left-right columns using CSS flexbox. The left directory is set to fixed positioning to ensure it remains visible while scrolling; the right content area has a left margin to avoid the fixed directory and enables vertical scrolling."
        },
        {
          "zh": "通过HTML的锚点链接（a标签href对应section的id）实现目录跳转，配合CSS的scroll-behavior: smooth实现平滑滚动效果，提升交互体验。",
          "en": "HTML anchor links (href corresponding to section id) enable directory navigation. Combined with CSS's scroll-behavior: smooth, smooth scrolling is achieved, enhancing user interaction."
        },
        {
          "zh": "目录添加了hover和active样式，鼠标悬停和当前激活的目录项会有视觉高亮，让用户清晰知道自己所处的阅读位置。",
          "en": "The directory items have hover and active styles, providing visual highlight when hovered or activated, helping users clearly understand their current reading position."
        }
      ]
    },
    {
      "id": "section3",
      "title": {
        "zh": "第三部分：详细说明",
        "en": "Part 3: Detailed Explanation"
      },
      "paragraphs": [
        {
          "zh": "样式方面，采用了浅灰色背景的目录栏，搭配白色正文背景，对比柔和，减少视觉疲劳；文字颜色选用深灰、中灰层级，标题添加蓝色下划线突出，整体配色简约且不单调。",
          "en": "In terms of styling, a light gray sidebar background with white content background provides a soft contrast and reduces visual fatigue. Text colors use deep and medium gray levels, with blue underlines for titles, creating a minimalist yet non-monotonous color scheme."
        },
        {
          "zh": "布局的尺寸做了适配性设计，目录宽度固定240px，正文区域自适应剩余宽度，正文内的段落设置了1.8倍行高和两端对齐，提升大段文字的阅读舒适度。",
          "en": "The layout uses adaptive sizing: the directory width is fixed at 240px, the content area adapts to remaining width, and paragraphs have 1.8x line height with justified alignment, enhancing the reading comfort of large text blocks."
        },
        {
          "zh": "如果目录项过多，左侧目录栏会自动开启垂直滚动；正文内容过长时，右侧也会独立滚动，两者滚动互不影响，保证导航的连续性。",
          "en": "If there are many directory items, the left sidebar automatically enables vertical scrolling; if content is too long, the right side also scrolls independently. The two scroll separately without affecting each other, maintaining navigation continuity."
        }
      ]
    },
    {
      "id": "section4",
      "title": {
        "zh": "第四部分：总结与展望",
        "en": "Part 4: Summary and Outlook"
      },
      "paragraphs": [
        {
          "zh": "本示例实现了极简的目录-正文左右布局，核心技术点为CSS flex布局、固定定位、锚点跳转和平滑滚动，代码结构清晰，易于修改和扩展。",
          "en": "This example demonstrates a minimalist directory-content left-right layout with core techniques including CSS flexbox, fixed positioning, anchor links, and smooth scrolling. The code is well-structured and easy to modify and extend."
        },
        {
          "zh": "后续可根据需求扩展功能，例如：适配移动端（添加媒体查询，移动端将目录改为顶部/底部导航）、添加目录随正文滚动自动激活、增加正文目录的折叠/展开功能、更换配色和字体样式等。",
          "en": "The functionality can be extended as needed, such as: mobile adaptation (adding media queries, converting directory to top/bottom navigation on mobile), auto-activating directory items during scrolling, adding collapsible directories, changing color schemes and fonts, and more."
        },
        {
          "zh": "同时，可根据实际使用场景调整布局尺寸，例如缩小目录宽度、调整正文内边距，或给整体容器添加最大宽度，避免大尺寸屏幕下正文行过长影响阅读。",
          "en": "Additionally, layout dimensions can be adjusted based on actual use cases, such as reducing directory width, adjusting content padding, or setting a maximum container width to prevent overly long lines on large screens that might affect readability."
        }
      ]
    }
  ]
}
